#include<stdio.h>
#include<stdlib.h>
/*颜色设置：
 *字背景颜色设置范围：
 40：黑  41：深红 42：绿 43：黄 44：蓝 45：紫色 46：深绿 47：白色
 字颜色： 30：黑 32：红 33：黄 34：蓝 35:紫色 36：深绿 37：白色
 *\33[0m  关闭所有属性
\33[1m 设置高亮  \33[4m 下划线
\33[7m 反显   \33[8m 消隐
\33[30m ... \33[37m设置前景色  \33[40m...\33[47m设置背景色 \33[nB 光标向下移动n行
A 光标向上移动n行 C 光标向右移动n行 D 光标向左移动n行
\33[y;xH 设置光标位置
\33[2J 清屏 \33[?25l  隐藏光标 \33[?25h 显示光标
 *
 * */
int main(){
	printf("\033[31m the .....\n\033[0m");
	printf("\033[2;7;1mHEOO.\n\033[2;7;0m");
	printf("\033[41;36msomthe here\n\033[0m");
	printf("hello world!\n");
	return 0;
}
